/**
 * data extracted from https://www.tokyodisneyresort.jp/tdl/attraction.html
 * named with `var areaNames` at line 3115 on 2024-12-21
 */
const areaNames = {
  "11": "ワールドバザール",
  "12": "アドベンチャーランド",
  "13": "ウエスタンランド",
  "14": "クリッターカントリー",
  "15": "ファンタジーランド",
  "16": "トゥーンタウン",
  "17": "トゥモローランド",
  "21": "メディテレーニアンハーバー",
  "22": "アメリカンウォーターフロント",
  "23": "ミステリアスアイランド",
  "24": "ポートディスカバリー",
  "25": "ロストリバーデルタ",
  "26": "マーメイドラグーン",
  "27": "アラビアンコースト",
  "29": "ファンタジースプリングス",
  "45": "パークエントランス",
};
